[
{"Job title": "Software Engineer (All Levels)", "Company": "Algorand, Inc.", "Company's logo Image Url": ["https://i.stack.imgur.com/1PAc9.png"], "Location": "– Boston, MA", "Skills Required": "\"go\",\"java\"", "Perks offered": ["Commuter Assistance Plans", "Health Insurance", "Dental Insurance", "Vision Insurance", "On-site Fitness center", "Work from Home Flexibility", "Paid Holidays"], "About This Job": ["Job type: ", "Full-time", "Experience level: ", "Junior, Mid-Level, Senior", "Industry: ", "blockchain technology, Computer Software", "Company size: ", "51–200 people"], "Description": "\r\nDevise innovative ideas for solving hard technical problems involving distributed systems, scale and security and translate these ideas into technical designs and implementation\r\nBe a hands-on coder applying the best industry standards for code health, security, scalability, and robustness\r\nBe a key part of an inclusive environment that fosters collaboration and creativity both internally and externally\r\n\r\nBachelor’s in Computer Science or a related technical field (level and depth of responsibilities will be adjusted for Master’s/PhD in Computer Science or a related technical field)\r\nTwo-plus years of experience working on and shipping complex applications as part of a team; advanced education will be considered (in extraordinary cases)\r\nExperience in any of the following: distributed systems, secure coding, network coding, performance optimizations\r\nExperience with one or more general purpose programming languages including but not limited to: Go, Java, C/C++, C#, and Rust\r\nExperience contributing to major open source software projects will be considered favorably\r\nExperience as a technical influencer for highly scalable distributed system designs preferred\r\nAbility to work in-office during regular business hours\r\n", "Job Link": "https://stackoverflow.com/jobs/393645/software-engineer-all-levels-algorand-inc"},
{"Job title": "Sr Software Mobile IOS Engineer", "Company": "Audible", "Company's logo Image Url": ["https://i.stack.imgur.com/sMzgN.png"], "Location": "– Cambridge, MA", "Skills Required": "\"ios\",\"objective-c\",\"iphone\"", "Perks offered": ["Health, Vision, & Dental", "Amazon Restricted Stock Units", "Fitness Reimbursement/Onsite Gym", "Tuition Reimbursement", "Commuter Assistance", "Catered Meals", "Culture and Sports Clubs", "Local Event Tickets", "Flex Time", "Newark Now! Live Local"], "About This Job": ["Job type: ", "Full-time", "Role: ", "Mobile Developer", "Industry: ", "Agile Software Development, Content Marketing, Web Technology", "Company size: ", "1k–5k people", "Company type: ", "Public"], "Description": "", "Job Link": "https://stackoverflow.com/jobs/417490/sr-software-mobile-ios-engineer-audible"},
{"Job title": "Backend Engineer", "Company": "TileDB, Inc.", "Company's logo Image Url": ["https://i.stack.imgur.com/UKRIt.png"], "Location": "– Cambridge, MA", "Skills Required": "\"c++\",\"data-structures\",\"parallel-processing\",\"amazon-s3\",\"posix\"", "Perks offered": ["Medical coverage", "Paid time off", "Stock options and bonuses", "Work remotely"], "About This Job": ["Job type: ", "Full-time", "Experience level: ", "Senior", "Role: ", "Backend Developer, DevOps", "Industry: ", "Data Science, Genomics, Geographic Information System", "Company size: ", "11–50 people", "Company type: ", "VC Funded"], "Description": "\r\nExperience using Kubernetes for production service deployments\r\nIn-depth experience with REST service designs\r\nIn-depth Golang Experience\r\nDev ops experience with DNS, logging and monitoring\r\nExperience debugging performance critical applications\r\nC/C++ experience (e.g., CGO)\r\n\r\nCompetitive salary and stock options\r\n100% medical and dental insurance coverage (for you and your dependents!)\r\nPaid parental leave\r\nPaid time off (vacation, sick & public holidays)\r\nFlexible time off & flexible hours\r\nFlexibility to work remotely (anywhere in the US or Greece)\r\n", "Job Link": "https://stackoverflow.com/jobs/419348/backend-engineer-tiledb-inc"},
{"Job title": "Microservices Software Engineer", "Company": "SimpliSafe", "Company's logo Image Url": ["https://i.stack.imgur.com/wTd1u.png"], "Location": "– Boston, MA", "Skills Required": "\"amazon-web-services\",\"rest\",\"node.js\",\"microservices\",\"cloud\"", "Perks offered": ["Unlimited PTO: because work-life balance is important", "Flexible BCBS Health Insurance options", "401k Matching (up to 4%) and Company Equity", "Free Onsite Gym Access (with locker room + showers)", "Pre-tax Commuter Accounts (transit and/or parking)", "Bagel Thursdays, Beer Fridays, Bi-weekly Catered Lunch", "Newly Renovated Office with Macbook Pro Laptops and Sit/Stand Desks", "Paid Quarterly Team Outings and Bi-Annual Company Parties", "Open-Office Floor Plan and Casual Dress", "Small, Collaborative Teams"], "About This Job": ["Job type: ", "Full-time", "Experience level: ", "Mid-Level, Senior, Lead", "Role: ", "Backend Developer", "Industry: ", "Consumer Electronics, Home Security, Smart Home", "Company size: ", "501–1k people", "Company type: ", "Private"], "Description": "\r\nExtensive professional experience (5+ years) writing web services at scale using one of Nodejs, Python, PHP, Ruby, Java, C#, or C++.\r\nWorking familiarity with at least one other language and a willingness to work in a polyglot development environment.\r\nThorough understanding of REST and web technology.\r\nExperience with cloud technology (AWS preferred) and designing solutions that leverage its unique advantages.\r\nCollaborative DevOps mindset and a passion for technology and learning. Enjoys mentoring teammates and helping everyone perform better.\r\nPractitioner of lean or agile software development principles and practices, understanding and advocating the importance of test automation, continuous delivery, continuous improvement, and value delivery.\r\n", "Job Link": "https://stackoverflow.com/jobs/350959/microservices-software-engineer-simplisafe"},
{"Job title": "Full Stack Engineer", "Company": "Inari Agriculture, Inc.", "Company's logo Image Url": ["https://grnhse-ghr-prod-s2.s3.amazonaws.com/external_greenhouse_job_boards/logos/400/226/800/resized/Inari_Logo.jpg?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=AKIA4XFBRPLSWPR3JUJR%2F20200714%2Fus-east-1%2Fs3%2Faws4_request&X-Amz-Date=20200714T113826Z&X-Amz-Expires=604800&X-Amz-SignedHeaders=host&X-Amz-Signature=f424dd679686646825b42c7c0d3742a89a8f7ca18c27894259a79231a5c035ff"], "Location": "– Cambridge, MA", "Skills Required": "\"amazon-web-services\",\"javascript\",\"ui\",\"infrastructure-as-code\",\"devops\"", "Perks offered": [], "About This Job": ["Job type: ", "Full-time", "Role: ", "DevOps, Full Stack Developer"], "Description": "\nWork with breeders and scientists to develop tools for data exploration, field data, and geospatial information, enabling our crops team to make product advancement decisions\nDevelop and productionalize applications that integrate with and extend our breeding, phenotyping, field trial analytics, and overall agronomic data platforms to process spatial and environmental data sets  \nDevelop robust integrations with strategic third party tools, platforms and models\nContribute to design and overall engineering roadmap\n\n4+ years of software engineering experience\nSolid foundation in UI frameworks such as VUE and React and experience in user experience design \nSignificant experience with professional software engineering, including automated testing, agile methodologies, pair programming, refactoring, relational databases, and microservices\nExperience with AWS tools, DevOps, infrastructure-as-code, and containerization\nExperience building front-ends geared towards data exploration\nModern Javascript experience required, Object Oriented Programming python is highly desired\nAbility to work in a fast-paced, cross functional environment in a self directed fashion\nA strong sense of purpose, and drive to develop unique, high impact solutions\nAdaptability and enthusiasm for new challenges; Innate curiosity and a passion for learning\nCreative and strategic thinking; willingness to be bold, take risks, and recognize and learn from failure\nA collaborative mindset; open to giving and receiving ideas, perspectives and feedback\nAbility to work both independently deliver on responsibilities, and in large within a highly collaborative environment projects\nAbility to effectively communicate with a diverse range of individuals and audiences\n\nExperience working with agricultural, remote sensing, weather, or other data which is spatial & temporal in nature\nFront-end work directly connected to scientific output, particularly in the bioinformatic and agronomic space\nFamiliarity with general web platform concepts including HTTP, HTTPS, CSS, CORS, and caching\nExperience with container technologies, docker, and kubernetes  \n", "Job Link": "https://stackoverflow.com/jobs/412371/full-stack-engineer-inari-agriculture-inc"},
{"Job title": "DevOps Engineers All Levels (Senior/Lead/Principal) (Multiple Locations)", "Company": "Salesforce", "Company's logo Image Url": ["https://i.stack.imgur.com/488Vy.jpg"], "Location": "– Boston, MA", "Skills Required": "\"java\",\"c++\",\"c#\",\"python\",\"ruby\",\"sysadmin\"", "Perks offered": ["Comprehensive medical, dental and vision; wellness reimbursement", "401(k) savings plan and company match", "Robust Employee Resource Groups", "Social, mobile, collaborative, and flexible work environments", "Free snacks and drinks", "7 days off per year to volunteer", "Paid time off", "Learning and development resources", "Opportunities to move across roles within company"], "About This Job": ["Job type: ", "Full-time", "Experience level: ", "Mid-Level, Senior, Lead", "Role: ", "DevOps, System Administrator", "Industry: ", "Cloud Services, Information Technology", "Company size: ", "10k+ people", "Company type: ", "Public"], "Description": "\r\nWork with engineers on the design, deployment and continuous improvement of important infrastructure services (i.e. logging, monitoring and alerting)\r\nScoping of work, management of backlog and predictability of project delivery.\r\nProvide input into long-range platform requirements and operational guidelines, with a focus on automation and continuous improvement of Platform Service Composability and availability.\r\nDevelop and own best practices/methodologies for provisioning, application scaling, configuration management, capacity planning, monitoring, etc. to improve organization-wide visibility into how distributed systems interact and perform in production.\r\nAnalyze and understand how customers are using the platform and help drive continuous improvement of the offering based on that.\r\nShare daily operational responsibilities with the team\r\nEnsure that we are continuously raising our standard of engineering excellence by implementing best practices for coding, testing, and deployment\r\n\r\nBS or MS in Computer Science or equivalent experience.\r\n3+ years work experience in a DevOps or similar role\r\nUnderstanding of OO programming and concepts (Java, C++, C#, Python)\r\nFluency in one or more scripting languages such as Python or Ruby.\r\nIn-depth, hands-on experience with Linux, networking, server, and cloud architectures.\r\nExperience in configuration management technologies such as Chef, Puppet or Ansible.\r\nExperience with AWS or another cloud PaaS provider.\r\nSolid understanding of how to configure, deploy, manage and maintain large cloud-hosted systems; including auto-scaling, monitoring, performance tuning, troubleshooting and disaster recovery.\r\nProficiency with source control, continuous integration, and testing pipelines.\r\nBeing a great listener, collaborator, communicator, and mentor.\r\nChampioning a culture and work environment that promotes diversity and inclusion\r\nA strong background in open source technology.\r\n\r\nExperience with HBase, Hadoop, and large-scale big data systems.\r\nExperience with Containers and orchestration services like Kubernetes, Docker etc.\r\nDeep understanding of fundamental network technologies like DNS, Load Balancing, SSL, TCP/IP, SQL, HTTP.\r\nKnowledge about cloud security and best practices.\r\n\r\nMS in Computer Science or related field, or\r\nBS in Computer Science plus relevant job-related experience\r\n", "Job Link": "https://stackoverflow.com/jobs/364241/devops-engineers-all-levels-senior-lead-salesforce"},
{"Job title": "Senior Software Developer", "Company": "Synectic Software Solutions", "Company's logo Image Url": ["https://cdn.sstatic.net/careers/Img/ico-no-company-logo.svg?v=15d9692a3221"], "Location": "– Wellesley, MA", "Skills Required": "\"c#\",\".net\",\"rest\",\"visual-studio\",\"windows\"", "Perks offered": [], "About This Job": ["Job type: ", "Full-time", "Experience level: ", "Senior", "Role: ", "Backend Developer"], "Description": "\r\nDevelop, manage, and prepare best software development solutions.\r\nProvide project management and technical leadership for every aspect of software.\r\nPrepare lifecycle for different projects inclusive of research, development, design, evaluation, testing along with delivery to product management.\r\nSupervise architecture plus lead efforts to develop technical roadmap of all projects.\r\nEstablish and stimulate software development standards and processes along with best practices for delivery of scalable and high-quality software.\r\nPerform closely with Engineers, Developers and Product Management throughout organization to influence product development assisting or improving products.\r\nDevelop relations with existing and prospective internal customers to interpret all individual requirements.\r\nLearn and display as how products would add value to respective business.\r\nManage and execute software development projects in continuous cycles.\r\nEvaluate projects, develop, and update schedules plus supervise project status.\r\nCollaborate effectively with all team members and provide structure to team.\r\n\r\nBachelor’s in computer science, Computer Systems Engineering or a similar engineering discipline.\r\nDemonstrated history of implementing and managing software development projects\r\n10+ years of experience in Software Development with Microsoft products\r\nProven delivery experience with C# .NET Windows Forms, ASP, MVVC, WCF, REST. Significant SQL server experience including schema development, query analysis and optimization.  Visual Studio.  Infragistics and Xamarin.\r\n", "Job Link": "https://stackoverflow.com/jobs/407800/senior-software-developer-synectic-software-solutions"},
{"Job title": "Lead Software Engineer", "Company": "Convene", "Company's logo Image Url": ["https://i.stack.imgur.com/fHqkn.png"], "Location": "– Boston, MA", "Skills Required": "\"node.js\",\"java\",\"web-services\"", "Perks offered": ["2017-2019 Certified Great Place to Work®.", "Convene is committed to building an inclusive and diverse workforce.", "Supportive work environment and leaders focused on your growth.", "Generous professional development policy with 65 hours of L&D a year.", "Flexible PTO and family leave.", "401k match.", "Excellent health coverage for team members and their families.", "Company events that highlight our team's passions and hobbies.", "Healthy snacks."], "About This Job": ["Job type: ", "Full-time", "Experience level: ", "Lead", "Industry: ", "Agile Software Development, Data Science, Real Estate Tech", "Company size: ", "501–1k people", "Company type: ", "VC Funded"], "Description": "\r\nLead the technical creation and evolution of the Convene's impactful customer-facing products.\r\nEnsure that the overall application and platform architectures are robust and easy to maintain. \r\nCollaborate with the companies technology leadership on technology roadmap and overall architecture.\r\nBe a hands-on leader who manages, mentors, and coaches your technical team members to success. \r\n\r\nDemonstrated success on an engineering team in a high-growth, highly volatile PE or VC-backed company delivering to large, sophisticated enterprise customers.\r\nSeven plus years of full-stack development using popular languages and frameworks such as NodeJS, Java, Ruby, and React.\r\nExperienced in managing cross-functional engineering teams, including mobile and front-end.\r\nMinimum of two years of direct NodeJS development, methodologies, and configuration.\r\nDaily responsibility with building out a microservice architecture using NodeJS and cloud services like AWS, Azure\r\nExperience conducting code reviews and mentoring team members in an Agile process.\r\n\r\nYou are engineering obsessed and devoted to getting it right and getting it done. \r\nYou are in love with change and enjoy being in a high-growth environment that is rapidly scaling.\r\nYou are comfortable with ambiguity and can carve out a path to a solution, using your skill and intuition to make quick and confident decisions in this high-growth context.\r\nYou are a person who always finds ways to help others on the team to learn, develop, and continually improve.\r\n\r\n2017-2019 Certified Great Place to Work®.\r\n2018 Fortune Best Small & Medium Workplaces U.S.\r\n#11 Workplace in New York in 2017 by Fortune Magazine.\r\n#30 in 2017 LinkedIn List of Most In-Demand Startups.\r\n\r\nSupportive work environment and leaders who are focused on your professional growth.\r\nGenerous professional development policy that includes funds earmarked for each employee's discretionary professional growth. Have a conference you want to attend? A class you want to take? If it's helping take your career to the next level, we support it. Each employee is required to have 65 hours of learning per year.\r\nFlexible PTO and family leave.\r\n401k match.\r\nExcellent health coverage for team members and their families.\r\nCompany events that highlight our team's passions and hobbies.\r\nHealthy snacks.\r\n", "Job Link": "https://stackoverflow.com/jobs/307444/lead-software-engineer-convene"},
{"Job title": "Senior Software Engineer, Back end (Conversations Product Group)", "Company": "HubSpot", "Company's logo Image Url": ["https://i.stack.imgur.com/kMj6p.png"], "Location": "– Cambridge, MA", "Skills Required": "\"java\",\"dropwizard\"", "Perks offered": ["Unlimited vacation", "Competitive salary and company equity", "Free fruit, yogurt, cereal, snacks, and coffee", "Flexible hours and work environment", "An engineering culture team dedicated to developer growth & happiness", "Management and technology workshops", "$5,000 tuition reimbursement", "Healthy @ HubSpot wellness programs", "Resource Groups: PeopleofColor@HubSpot, LGBTQ Alliance, Women@HubSpot", "Parental Benefits, Programming, & Perks (Bring Your Kids to Work Day)"], "About This Job": ["Job type: ", "Full-time", "Experience level: ", "Mid-Level, Senior, Lead", "Role: ", "Backend Developer", "Industry: ", "B2B Sales, Cloud Services, Marketing Software", "Company size: ", "1k–5k people", "Company type: ", "Public"], "Description": "\r\nA strong engineer interested in writing in Java\r\nTake ownership, work collaboratively, and figure things out\r\nConsistently work to deliver reliable, performant, well-tested code\r\nHave a thirst for technical challenges with big data and distributed systems, including HBase, Kafka, Elasticsearch and Dropwizard\r\nDemonstrate pragmatic decision making and problem-solving abilities\r\nHave a customer-centric attitude and develop opinions about the HubSpot product\r\nCan think through problems with a “real-time” angle, as live conversations between our customers and their customers are always-on, and don’t follow a typical request/response model\r\n", "Job Link": "https://stackoverflow.com/jobs/368605/senior-software-engineer-back-end-conversations-hubspot"},
{"Job title": "Senior Software Engineer - UI Angular", "Company": "Citizens Bank", "Company's logo Image Url": ["https://i.stack.imgur.com/UmxPh.png"], "Location": "– Boston, MA", "Skills Required": "\"angularjs\",\"user-interface\",\"css\",\"rxjs\",\"ngrx\"", "Perks offered": ["Generous PTO", "Flexible Work Schedules", "Learning and Development Resources & Educational Assistance", "Comprehensive Health Benefits", "Volunteer Events & Corporate Match Program", "Parental Leave for All Parents, Including Adoptive", "Onsite Café & Coffee Bar (some locations)", "Gym & Classes (some locations)", "401k Matching & Employee Stock Purchase Program", "Discounts on Bank Services, Including Student Loan Refinancing"], "About This Job": ["Job type: ", "Full-time", "Experience level: ", "Mid-Level, Senior", "Industry: ", "Banking, Financial Services, Financial Technology", "Company size: ", "10k+ people", "Company type: ", "Public"], "Description": "\r\nDevelop native Angular components for cloud based commercial technology applications.\r\nDesign, develop, deploy and support front-end UI for world-class enterprise-level commercial banking products.\r\nPromote centralized technical architecture and design processes.\r\nImplement new design specifications and raise front-end code standards.\r\nService a wide range of complex projects, assignments and issues.\r\nOptimize the usability, accessibility, performance and scalability of FICO software products.\r\nCollaborate with back-end developers on topics such as database architecture, performance, security and privacy.\r\nContinuous research and education in front-end technologies.\r\nFront-end guidance and mentorship across the organization.\r\n\r\nFront-end development experience with Angular (version 7+)and JavaScript proficiency (Large enterprise application experience a plus).\r\nExperience writing semantically clean HTML5 and CSS, using SASS or LESS with mixins and variables.\r\nFamiliarity with Chrome developer tools: ability to use them to diagnose rendering issues, caching etc.\r\nUnderstanding of RxJs and NgRx patterns: able to utilize them to solve critical state-management challenges.\r\nWell versed working with component libraries such as Bootstrap, Material, or Semantic-UI.\r\nExperience working with User Experience teams and an agile User-Centered design process.\r\nA strong eye for detail and ability to write elegant, well-commented, readable code.\r\nA history building consensus with other disciplines.\r\n\r\nBachelor’s degree or equivalent\r\n", "Job Link": "https://stackoverflow.com/jobs/409589/senior-software-engineer-ui-angular-citizens-bank"},
{"Job title": "Senior Software Engineer, Platform Infrastructure", "Company": "HubSpot", "Company's logo Image Url": ["https://i.stack.imgur.com/kMj6p.png"], "Location": "– Boston, MA", "Skills Required": "\"java\",\"python\",\"mysql\",\"database\",\"elasticsearch\"", "Perks offered": ["Unlimited vacation", "Competitive salary and company equity", "Free fruit, yogurt, cereal, snacks, and coffee", "Flexible hours and work environment", "An engineering culture team dedicated to developer growth & happiness", "Management and technology workshops", "$5,000 tuition reimbursement", "Healthy @ HubSpot wellness programs", "Resource Groups: PeopleofColor@HubSpot, LGBTQ Alliance, Women@HubSpot", "Parental Benefits, Programming, & Perks (Bring Your Kids to Work Day)"], "About This Job": ["Job type: ", "Full-time", "Experience level: ", "Mid-Level, Senior, Lead", "Industry: ", "B2B Sales, Cloud Services, Marketing Software", "Company size: ", "1k–5k people", "Company type: ", "Public"], "Description": "\r\nSomeone with experience developing automation or is a power user of one or more of the above-mentioned data storage technologies.\r\nWillingness and ability to work with the user base, in this case, other developers, to define and build tools that make the lives of application developers easier and their code less error-prone through automation.\r\nInterested in working with and supporting infrastructure at scale.\r\nSomeone who has shown that they can solve complicated technical problems and analyze tradeoffs with empathy for the developers, yet building creative solutions.\r\nAble to demonstrate pragmatic decision making and problem-solving abilities.\r\n", "Job Link": "https://stackoverflow.com/jobs/364001/senior-software-engineer-platform-infrastructure-hubspot"},
{"Job title": "Full-Stack Developer", "Company": "TrinityRock Advisors", "Company's logo Image Url": ["https://i.stack.imgur.com/2Lism.png"], "Location": "– Boston, MA", "Skills Required": "\"oop\",\"mysql\",\"php\",\"python\",\"reactjs\"", "Perks offered": ["Dynamic & Fast Pace work environment", "Entrepreneurial Atmosphere", "Variety of Technologies and languages to work with and learn", "Culture fit is critical to everyone's success", "No Politics or silos", "Start up Mentality with years of experience"], "About This Job": ["Job type: ", "Full-time", "Experience level: ", "Mid-Level, Senior, Lead", "Role: ", "Full Stack Developer", "Industry: ", "Agile Software Development, Big Data, Cloud Computing", "Company size: ", "1–10 people", "Company type: ", "Private"], "Description": "\r\nWorking closely with other team members developing in an agile framework\r\nDeveloping reusable components to be used on large scale enterprise web applications\r\nBuilding sound technical solutions to meet user requirements\r\nIntegrating with relational database systems\r\n\r\nProven programming experience building with web-based technologies such as PHP, Python, NodeJS, and/or MYSQL\r\nStrong Object-Oriented Programming (OOP) experience\r\nSystems Integration experience and leveraging documented API’s\r\nCritical thinking, problem-solving, ability to write efficient and maintainable code\r\nKnowledge of best practices and coding patterns to ensure the consistency of technology solutions and development.\r\n\r\nSalesforce.com (Lightning components, Apex, Visualforce, S-control, SOQL)\r\nUI/UX design experience using Sketch\r\nKnowledge with responsive design\r\nJavaScript framework experience, such as Angular or React\r\nPrior experience building Salesforce Lightning components and/or developing with Salesforce Apex would be an added advantage.\r\nExperience with Java/J2EE Framework components like JSP, EJB, JDBC, JMS, JAXP and knowledge of their API Internals\r\n", "Job Link": "https://stackoverflow.com/jobs/345792/full-stack-developer-trinityrock-advisors"},
{"Job title": "Software Engineer, Performance Engineering (Senior/Lead/Principal)", "Company": "Salesforce", "Company's logo Image Url": ["https://i.stack.imgur.com/488Vy.jpg"], "Location": "– Boston, MA", "Skills Required": "\"java\",\"sql\",\"jvm\",\"javascript\",\"hadoop\"", "Perks offered": ["Comprehensive medical, dental and vision; wellness reimbursement", "401(k) savings plan and company match", "Robust Employee Resource Groups", "Social, mobile, collaborative, and flexible work environments", "Free snacks and drinks", "7 days off per year to volunteer", "Paid time off", "Learning and development resources", "Opportunities to move across roles within company"], "About This Job": ["Job type: ", "Full-time", "Experience level: ", "Mid-Level, Senior, Lead", "Industry: ", "Cloud Services, Information Technology", "Company size: ", "10k+ people", "Company type: ", "Public"], "Description": "\r\n6+ years of software development experience (Java preferred)\r\n3+ years in performance engineering\r\nStrong programming skills in Java and profilers\r\nHands-on experience with performance measurement, analysis, and optimization\r\nExperience conducting benchmark and/or work-load testing using automation tools and frameworks for performance measurement and analysis (Jmeter)\r\nExperience performing simulation or lab experimentation to analyze application/ system performance\r\nDistributed systems debugging\r\nAbility to work cross-functionally to articulate, measure and solve performance issues\r\nPassion for continuous improvement in building knowledge base technically and professionally\r\nBachelor’s degree (or its foreign degree equivalent) in Computer Science, Engineering, or a related technical discipline.\r\n\r\nSaaS experience at scale\r\nKnowledge of database fundamentals: SQL, schema, internals (Oracle preferred, TKProf, AWR, ASH)\r\nJVM and garbage collector tuning, heap dump analysis experience\r\nExperience with the following performance tools:  JMeter, YourKit\r\nExperience in using UI profilers and deep understanding of chrome developer tools\r\nUnderstanding of how a browser works (i.e. chromedevtools, ui automator)\r\nHands on Experience in javascript, React and NodeJS\r\nAgile/ Scrum methodology experience\r\nExperience with big data technologies such as Hbase, HDFS, Hadoop, Pig, Hive and/or Kafka\r\nExperience working in an Apache/ Spark architecture\r\nKnowledge of back-end systems and API’s, developer tools and compilers\r\nKnowledge of statistical analysis and experimental design techniques\r\nWorking knowledge of Linux operating system\r\nExperience analyzing and interpreting large volume of production data using Splunk to understand throughput, latency, memory and CPU utilization\r\nExperience with search platforms such Lucene, Solr or ElasticSearch\r\n", "Job Link": "https://stackoverflow.com/jobs/364234/software-engineer-performance-engineering-salesforce"},
{"Job title": "Senior Node.js Software Engineer", "Company": "SimpliSafe", "Company's logo Image Url": ["https://i.stack.imgur.com/wTd1u.png"], "Location": "– Boston, MA", "Skills Required": "\"node.js\",\"cloud\",\"amazon-web-services\",\"rest\",\"microservices\"", "Perks offered": ["Unlimited PTO: because work-life balance is important", "Flexible BCBS Health Insurance options", "401k Matching (up to 4%) and Company Equity", "Free Onsite Gym Access (with locker room + showers)", "Pre-tax Commuter Accounts (transit and/or parking)", "Bagel Thursdays, Beer Fridays, Bi-weekly Catered Lunch", "Newly Renovated Office with Macbook Pro Laptops and Sit/Stand Desks", "Paid Quarterly Team Outings and Bi-Annual Company Parties", "Open-Office Floor Plan and Casual Dress", "Small, Collaborative Teams"], "About This Job": ["Job type: ", "Full-time", "Experience level: ", "Mid-Level, Senior, Lead", "Role: ", "Backend Developer", "Industry: ", "Consumer Electronics, Home Security, Smart Home", "Company size: ", "501–1k people", "Company type: ", "Private"], "Description": "\r\nBuild solutions from their inception through production, from design, develop, test and deployment.\r\nWork with product owners to understand their needs and deliver solutions in a test and learn approach.\r\nBreak larger services into microservices which are:\r\n\r\nSmall, and independent\r\nEasy to learn, change, extend\r\nEnable self-service by service users\r\n\r\n\r\n\r\nExtensive professional experience (5+ years) writing web services at scale using one of Nodejs, Python, PHP, Ruby, Java, C#, or C++.\r\nWorking familiarity with at least one other language and a willingness to work in a polyglot development environment.\r\nThorough understanding of REST and web technology.\r\nExperience with cloud technology (AWS preferred) and designing solutions that leverage its unique advantages.\r\nCollaborative DevOps mindset and a passion for technology and learning. Enjoys mentoring teammates and helping everyone perform better.\r\nPractitioner of lean or agile software development principles and practices, understanding and advocating the importance of test automation, continuous delivery, continuous improvement, and value delivery.\r\n\r\nHealth, dental and vision coverage - We cover 85% of plans and offer excellent BCBS HMO/PPO Health plans\r\nUnlimited paid time off - To give you the flexibility and work/life balance you seek\r\n401k Matching and Company Equity - To help you prepare for the future\r\nCommuter Pre-Tax Benefits - To help cover the costs of transportation and parking at our Downtown Boston HQ\r\nBeer Fridays, Bagel Thursdays, Bi-Weekly Lunches, Team and Company Outings – We know how to have fun! Besides, who doesn’t like free food and drinks?!\r\n", "Job Link": "https://stackoverflow.com/jobs/350962/senior-nodejs-software-engineer-simplisafe"},
{"Job title": "Senior Software Engineer/Technical Lead", "Company": "Harvard Medical School", "Company's logo Image Url": ["https://i.stack.imgur.com/pbJGi.jpg"], "Location": "– Boston, MA", "Skills Required": "\"gcp\",\"git\",\"go\",\"javascript\"", "Perks offered": [], "About This Job": ["Job type: ", "Full-time", "Experience level: ", "Senior, Lead"], "Description": "\r\nGit API, custom server implementations (e.g. Gitea, GO web stack)\r\nGoogle cloud platform, including database and scheduling services\r\nRich Javascript UIs for visualization of large data (WebGL, d3.js, etc.)\r\n\r\nParticipate fully in software development life cycle\r\nLead development of technical solutions to deliver business requirements\r\nParticipate in long term strategic planning for the application portfolio(s)\r\nEstablish and maintain internal/external stakeholder relationships\r\nAbide by and follow the Harvard University IT technical standards, policies and Code of Conduct\r\n\r\nMinimum of five years' post-secondary education and/or relevant work experience\r\n\r\nKnowledge of information technology applications, processes, software and equipment\r\nHighly specialized knowledge of a specific technology\r\nDemonstrated team performance skills, service mindset approach, and the ability to act as a trusted advisor\r\nBachelor’s degree in Computer Science, Bioinformatics or related field and 6 years related experience.\r\nExperience in developing, testing, and deploying cloud-based web-oriented applications.\r\nExperience with version control systems and team software development\r\nExperience with Google Cloud Platform\r\nAdvanced understanding of Git protocol and server implementations\r\nExperience with GO programming language and its applications to web programming\r\nPrevious experience working with large datasets\r\nPrevious experience working with crowd-sourced content\r\nAbility to work independently, manage own time, and learn quickly.\r\nStrong communication skills with both technical and non-technical clients.\r\nAutomated testing, Continuous integration/deployment\r\n\r\nCompletion of Harvard IT Academy specified foundational courses (or external equivalent) preferred\r\n", "Job Link": "https://stackoverflow.com/jobs/410708/senior-software-engineer-technical-lead-harvard-medical-school"},
{"Job title": "Senior Software Engineer, Frontend", "Company": "HubSpot", "Company's logo Image Url": ["https://i.stack.imgur.com/kMj6p.png"], "Location": "– Cambridge, MA", "Skills Required": "\"reactjs\",\"javascript\",\"css\",\"sass\",\"redux\"", "Perks offered": ["Unlimited vacation", "Competitive salary and company equity", "Free fruit, yogurt, cereal, snacks, and coffee", "Flexible hours and work environment", "An engineering culture team dedicated to developer growth & happiness", "Management and technology workshops", "$5,000 tuition reimbursement", "Healthy @ HubSpot wellness programs", "Resource Groups: PeopleofColor@HubSpot, LGBTQ Alliance, Women@HubSpot", "Parental Benefits, Programming, & Perks (Bring Your Kids to Work Day)"], "About This Job": ["Job type: ", "Full-time", "Experience level: ", "Senior", "Role: ", "Frontend Developer", "Industry: ", "B2B Sales, Cloud Services, Marketing Software", "Company size: ", "1k–5k people", "Company type: ", "Public"], "Description": "\r\nPrevious software engineering experience\r\nExpert level knowledge of JavaScript\r\nExperience with a JavaScript framework such as React, Angular, Backbone or Ember\r\nDemonstrated empathy for design and UX best practice\r\nYou're comfortable with HTML, CSS and related technologies\r\nBonus points for ES6, SASS, Redux or Flux\r\n", "Job Link": "https://stackoverflow.com/jobs/366020/senior-software-engineer-frontend-hubspot"},
{"Job title": ".NET Full Stack Dev for Growing Healthcare Company", "Company": "eHana LLC", "Company's logo Image Url": ["https://i.stack.imgur.com/K0jJV.png"], "Location": "– Boston, MA", "Skills Required": "\"c#\",\"asp.net\",\"javascript\",\"sql-server\",\"angular\"", "Perks offered": ["Positive & collaborative, founder-led culture", "Competitive vacation policy", "Full Health/Vision/Dental/Life", "401(k) with employer match", "Mass-transit passes & BlueBikes bike share membership", "\"eHana Enlightenment Fund\" to encourage personal development", "Monthly Team Lunches & Birthday Celebrations", "Flexible Work Hours!", "Employer supported Health Savings Account"], "About This Job": ["Job type: ", "Full-time", "Experience level: ", "Mid-Level", "Role: ", "Full Stack Developer", "Industry: ", "Healthcare, SaaS", "Company size: ", "11–50 people", "Company type: ", "Private"], "Description": "\r\nPermanent unrestricted legal right to work in the US required\r\n5+ years of web application development experience\r\nHighly effective written and verbal communication skills with a collaborative work style\r\nExperience with the specific technologies we use (Angular, ASP.NET/C#, and Microsoft SQL Server) is always nice but not required. If you’re confident you can learn, let’s talk!\r\n", "Job Link": "https://stackoverflow.com/jobs/413513/net-full-stack-dev-for-growing-healthcare-company-ehana-llc"},
{"Job title": "Senior Software Engineer, Platform UI", "Company": "HubSpot", "Company's logo Image Url": ["https://i.stack.imgur.com/kMj6p.png"], "Location": "– Boston, MA", "Skills Required": "\"reactjs\",\"user-interface\",\"javascript\",\"redux\",\"html\"", "Perks offered": ["Unlimited vacation", "Competitive salary and company equity", "Free fruit, yogurt, cereal, snacks, and coffee", "Flexible hours and work environment", "An engineering culture team dedicated to developer growth & happiness", "Management and technology workshops", "$5,000 tuition reimbursement", "Healthy @ HubSpot wellness programs", "Resource Groups: PeopleofColor@HubSpot, LGBTQ Alliance, Women@HubSpot", "Parental Benefits, Programming, & Perks (Bring Your Kids to Work Day)"], "About This Job": ["Job type: ", "Full-time", "Experience level: ", "Mid-Level, Senior, Lead", "Role: ", "Frontend Developer", "Industry: ", "B2B Sales, Cloud Services, Marketing Software", "Company size: ", "1k–5k people", "Company type: ", "Public"], "Description": "\r\nBlazar: Our internal CI system that executes thousands of builds every day\r\nOrion: Our deployment orchestrator that our engineers use to deploy code to Production hundreds of times a day\r\nLogFetch: Our log querying and visualization tool built on top of AWS Athena\r\nKepler: Our all-in-one monitoring and alert review tool\r\nJanus: Our low-friction system for requesting and granting access to infrastructure resources (Databases, kafka topics, Elasticsearch clusters, etc.)\r\nOur self-service MySQL database provisioning and slow query diagnosis tools\r\n\r\nYou’re looking for a frontend role with a backend twist\r\nYou’re passionate about building elegant, easy-to-use tools with fellow developers for fellow developers\r\nYou’re interested in learning, sharpening your skills, and sharing that knowledge with a team and the world\r\nYou enjoy taking part in designing and transforming complex workflows into self-service tools\r\nYou love systems where humans are never the bottleneck\r\n", "Job Link": "https://stackoverflow.com/jobs/408469/senior-software-engineer-platform-ui-hubspot"},
{"Job title": "Senior Software Engineer", "Company": "Cumulus Digital Systems, Inc.", "Company's logo Image Url": ["https://i.stack.imgur.com/YnP5Z.png"], "Location": "– Cambridge, MA", "Skills Required": "\"reactjs\",\"react-native\",\"amazon-web-services\",\"node.js\",\"asp.net\"", "Perks offered": ["Competitive salaries", "Participation in our equity incentive plan", "Unlimited paid time off", "Commuter benefits for public transportation", "Health and dental insurance", "Flexible Spending Account", "Retirement benefits account", "Flexible work schedules", "Workplace perks such as snacks/coffee"], "About This Job": ["Job type: ", "Full-time", "Experience level: ", "Senior", "Industry: ", "Data Analysis, Industrial Automation, Internet of Things", "Company size: ", "11–50 people", "Company type: ", "VC Funded"], "Description": "\r\nAmazon Web Services\r\nFunctional Programming methodologies\r\nUpholding high-bar of UX principles and technical trade-offs\r\nGraphQL and JSON APIs\r\nGit and GitHub workflows\r\nOffline device operation and data synchronization considerations\r\nWriting testable code, and using Continuous Integration tools\r\nBe a responsible team member: do code reviews, mentor others, refactor code and share knowledge \r\nEnsure that a healthy, safe, secure and environmentally conscious work environment is maintained always and by all staff, in compliance with corporate policies and federal and state regulations\r\n\r\nRelevant engineering degree(s) with a solid understanding of computer science \r\nFamiliarity with spiral and agile software development\r\nWeb Application Skills, including HTML, JavaScript, CSS, and ReactJS \r\nExperience working in an Agile/Scrum development process\r\nExpert in JavaScript, using modern web practices (Promises, ES 2016, Babel) and Node.js with Express or Hapi \r\nExperience using Webpack \r\nExperience with Continuous Integration and/or Continuous Delivery \r\nExperience with UI frameworks such as Blueprint or Material-UI \r\nExtremely proficient at creating, consuming, and documenting RESTful services and architecture \r\nExpert using browser tooling for profiling and auditing. \r\nExperience using unit testing libraries and utilities such as Jest \r\nUI/UX Skills:\r\n\r\nDeveloping business/user objectives and user flow\r\nWireframing, prototyping and virtual design mock ups \r\n\r\n\r\nWillingness to travel up to 25% domestically and internationally \r\nWillingness to deploy to the field for up to four weeks at a time \r\nAbility and drive to deliver on time, while working in a semi-autonomous environment \r\nAbility to create and communicate an accurate schedule \r\nWillingness to learn to work with the tools and solutions selected by the team \r\nInsatiable curiosity to understand and improve the state of art \r\nAbility to work effectively and build relationships with all levels of personnel, customers, suppliers, consultants - both internally and externally \r\n\r\nCompetitive salaries\r\nParticipation in our equity incentive plan\r\nUnlimited paid time off\r\nCommuter benefits for public transportation\r\nHealth and dental insurance\r\nFlexible Spending Account\r\nRetirement benefits account\r\nWorkplace perks such as snacks/coffee and flexible work schedules\r\n", "Job Link": "https://stackoverflow.com/jobs/294020/senior-software-engineer-cumulus-digital-systems-inc"},
{"Job title": "Senior Backend Software Engineer, Marketing Hub", "Company": "HubSpot", "Company's logo Image Url": ["https://i.stack.imgur.com/kMj6p.png"], "Location": "– Cambridge, MA", "Skills Required": "\"java\",\"web-services\",\"mysql\",\"kafka\",\"memcached\"", "Perks offered": ["Unlimited vacation", "Competitive salary and company equity", "Free fruit, yogurt, cereal, snacks, and coffee", "Flexible hours and work environment", "An engineering culture team dedicated to developer growth & happiness", "Management and technology workshops", "$5,000 tuition reimbursement", "Healthy @ HubSpot wellness programs", "Resource Groups: PeopleofColor@HubSpot, LGBTQ Alliance, Women@HubSpot", "Parental Benefits, Programming, & Perks (Bring Your Kids to Work Day)"], "About This Job": ["Job type: ", "Full-time", "Experience level: ", "Senior", "Role: ", "Backend Developer", "Industry: ", "B2B Sales, Cloud Services, Marketing Software", "Company size: ", "1k–5k people", "Company type: ", "Public"], "Description": "\r\nWould love to write lots of micro-services, primarily with Java 11 (our APIs are RESTful and use the minimal Dropwizard framework)\r\nWant to grow their career in a fast paced, low bureaucracy environment\r\nLike the idea of working on a small, customer-driven development teams of 3-5 engineers.\r\nDive into concepts they may be unfamiliar with \r\nAre passionate about delivering exceptional experiences to our customers\r\nTake ownership, work collaboratively, and figure things out\r\nAnalyze trade-offs with empathy, yet building creative solutions.\r\n", "Job Link": "https://stackoverflow.com/jobs/403066/senior-backend-software-engineer-marketing-hub-hubspot"},
{"Job title": "Fullstack Software Engineer", "Company": "Clarity Innovations", "Company's logo Image Url": ["https://i.stack.imgur.com/bqPD3.png"], "Location": "– Boston, MA", "Skills Required": "\"node.js\",\"javascript\",\"php\",\"java\",\"reactjs\"", "Perks offered": ["6% 401k Match Immediately vested", "up to 4% additional 401k  Profit Share with 2 year Vesting", "Care First Medical", "Carefirst Dental and Vision Paid by Employer", "Bonus Potential", "11 Paid Holidays"], "About This Job": ["Job type: ", "Full-time", "Experience level: ", "Mid-Level, Senior", "Role: ", "Full Stack Developer", "Industry: ", "Cloud-Based Solutions, Software Development, Software Development / Engineering", "Company size: ", "11–50 people", "Company type: ", "Private"], "Description": "\r\nExperience with Java, JavaScript or Python enterprise application development\r\nExperience with Web services architecture, design, and development to include microservice architectures\r\nExperience with database design including relational, spatial and NoSQL databases\r\nExperience with Agile philosophies serving as scrum or team lead\r\nExperience with CI/CD techniques and automated testing and pipelines\r\nUS Citizen with ability to get cleared\r\n\r\nExperience with Spring applications\r\nExperience as a full stack developer to include Web Services, Database and Front-End Development\r\nExperience with React\r\nExperience working with and developing geospatial information systems (GIS) to include open-source and proprietary geospatial formats\r\nLikes to play ping pong, foosball or Nintendo Switch (or willing to learn)\r\n", "Job Link": "https://stackoverflow.com/jobs/285780/fullstack-software-engineer-clarity-innovations"},
{"Job title": "Software Engineer All Levels (Senior/Lead/Principal)", "Company": "Salesforce", "Company's logo Image Url": ["https://i.stack.imgur.com/488Vy.jpg"], "Location": "– Boston, MA", "Skills Required": "\"java\",\"c++\",\"ruby\",\"go\",\"scala\"", "Perks offered": ["Comprehensive medical, dental and vision; wellness reimbursement", "401(k) savings plan and company match", "Robust Employee Resource Groups", "Social, mobile, collaborative, and flexible work environments", "Free snacks and drinks", "7 days off per year to volunteer", "Paid time off", "Learning and development resources", "Opportunities to move across roles within company"], "About This Job": ["Job type: ", "Full-time", "Experience level: ", "Mid-Level, Senior, Lead", "Industry: ", "Cloud Services, Information Technology", "Company size: ", "10k+ people", "Company type: ", "Public"], "Description": "\r\nEat, sleep, and breathe services. You have experience balancing live-site management, feature delivery, and retirement of technical debt\r\nExperience designing, developing, debugging, and operating resilient distributed systems\r\nExperience with managing large, complex systems in cloud-based infrastructure\r\nResolve complex technical issues and drive innovations that improve system availability, resilience, and performance\r\nFamiliarity with crash-only and recovery-oriented software design\r\nExcited by building reliable, self-healing services on unreliable hardware\r\nCapable of driving and delivering thin slices of functionality on a regular cadence with data-driven feedback loops in an agile environment\r\nBe passionate about automation\r\nCreate, maintain and share technical documentation used by engineers and other team members\r\n\r\nExperience in a Linux/UNIX/Windows data center environment\r\nAny of the following languages: Java, C++, C, C#, Ruby, Go, Scala, Python, Bash, Chef\r\nExperience owning and operating multiple instances of mission-critical services\r\nExperience with Agile development methodology and Test-Driven Development\r\nExperience using telemetry and metrics to drive operational excellence\r\nIn-depth understanding of OOP, design patterns, data structures, algorithms, and concurrency\r\n\r\nMS in Computer Engineer/Science or related field, or\r\nBS in Computer Engineer/Science plus relevant job-related experience\r\n\r\nExperience with software-based infrastructure such as AWS, Azure, GCE, CoreOS\r\nExperience with container orchestration systems Kubernetes, Docker, Helios, Fleet\r\nNetwork technologies like DNS, Load Balancing, SSL, TCP/IP, SQL, HTTP\r\nExperience with open source projects like HBase, Phoenix, Kafka, HDFS, Hadoop, Cassandra, Zookeeper, OpenTSDB, Logstash, ElasticSearch, Splunk, Puppet, Spinnaker\r\nExperience using SQL and/or NoSQL datastores e.g. Oracle, Microsoft SQL Server, etc\r\nCI/CD experience with Jenkins\r\nPublic cloud engineering on GCP,  AWS and or Azure platforms ​\r\n\r\nCloud provisioning and infrastructure\r\n\r\n\r\nImplementation experience of large infrastructure projects  \r\n\r\n", "Job Link": "https://stackoverflow.com/jobs/364209/software-engineer-all-levels-senior-lead-salesforce"},
{"Job title": "Full-Stack Software Engineer (Senior, Lead, Principal) – Application Development", "Company": "Salesforce", "Company's logo Image Url": ["https://i.stack.imgur.com/488Vy.jpg"], "Location": "– Boston, MA", "Skills Required": "\"javascript\",\"java\",\"c++\",\"ruby\",\"python\"", "Perks offered": ["Comprehensive medical, dental and vision; wellness reimbursement", "401(k) savings plan and company match", "Robust Employee Resource Groups", "Social, mobile, collaborative, and flexible work environments", "Free snacks and drinks", "7 days off per year to volunteer", "Paid time off", "Learning and development resources", "Opportunities to move across roles within company"], "About This Job": ["Job type: ", "Full-time", "Experience level: ", "Mid-Level, Senior, Lead", "Role: ", "Full Stack Developer", "Industry: ", "Cloud Services, Information Technology", "Company size: ", "10k+ people", "Company type: ", "Public"], "Description": "", "Job Link": "https://stackoverflow.com/jobs/364226/full-stack-software-engineer-senior-lead-salesforce"},
{"Job title": "Healthcare Services Company seeks a Sr Front End Developer", "Company": "Logisticare", "Company's logo Image Url": ["https://i.stack.imgur.com/lQVSn.png"], "Location": "– Boston, MA", "Skills Required": "\"django\",\"reactjs\",\"python\",\"javascript\",\"angular\"", "Perks offered": ["Fun & flexible team", "Commuting benefit", "Cold brew coffee on tap", "Awesome downtown location", "Bright, big, sunny office", "Competitive compensation"], "About This Job": ["Job type: ", "Full-time", "Experience level: ", "Mid-Level, Senior, Lead", "Role: ", "Frontend Developer", "Industry: ", "Healthcare, Transportation, Web Technology", "Company size: ", "1k–5k people", "Company type: ", "Public"], "Description": "", "Job Link": "https://stackoverflow.com/jobs/399484/healthcare-services-company-seeks-a-sr-front-end-logisticare"},
{"Job title": "Backend Engineer", "Company": "Armored Things", "Company's logo Image Url": ["https://i.stack.imgur.com/vzKAF.png"], "Location": "– Boston, MA", "Skills Required": "\"scala\",\"java\",\"apache-kafka\",\"python\",\"postgresql\"", "Perks offered": ["Diversity of people, perspectives, ideas and cultures (you'll fit in)", "100% paid employee insurance (health, dental, vision, disability)", "Great location in Boston's Liberty Square (fun, food, arts, greenway)", "Convenient to all public transportation (and we'll cover your T pass)", "Flexible hours and unlimited personal time (and the ability to use it)", "Early-stage equity (we're all owners and earners of our success)"], "About This Job": ["Job type: ", "Full-time", "Experience level: ", "Mid-Level, Senior, Lead", "Role: ", "Backend Developer", "Industry: ", "Artificial Intelligence, Cybersecurity, Public Safety", "Company size: ", "11–50 people", "Company type: ", "VC Funded"], "Description": "\r\nA Bachelor's degree in computer science or a related field\r\nAt least seven years relevant experience coding and developing production software\r\nRoles that demonstrate project, technical, and team leadership\r\nFluency in at least two languages like Scala, Clojure, Haskell, Python, or Java\r\nPrior experience with--and a solid understanding of--functional programming\r\nPast experience with stream processing, data pipelines and distributed systems\r\n", "Job Link": "https://stackoverflow.com/jobs/322319/backend-engineer-armored-things"},
{"Job title": "Senior Lead Software Engineer, Architecture", "Company": "DraftKings", "Company's logo Image Url": ["https://i.stack.imgur.com/QP40k.png"], "Location": "– Boston, MA", "Skills Required": "\"reactjs\",\"typescript\",\"javascript\",\"node.js\"", "Perks offered": ["3 Month Gym Reimbursement", "Commuter Benefit", "Unlimited Paid Time Off", "Optional Life Insurance", "Vanguard 401(k) Plan with Company Match", "Casual Work Attire", "Happy hours", "Catered food", "Unlimited snacks", "Tuition Reimbursement"], "About This Job": ["Job type: ", "Full-time", "Experience level: ", "Senior, Lead", "Industry: ", "B2C, Software Development, Sports Technology", "Company size: ", "1k–5k people", "Company type: ", "Public"], "Description": "\r\nTake ownership of development, maintenance, testing strategy, design discussions and operations of a front-end team, with the majority of your code in React + Typescript\r\nCare about agility and reuse as much as you care about scalability. We roll out products very quickly and are looking for a team that can pivot at a moment’s notice.\r\nGuide your team, and the product teams in design sessions and help them deliver high quality work\r\nDrive the team in maintenance, implementation and improvement of the core front-end components for everything from UI, event handling and messaging\r\nWork with teams to identify software in their products that can be componentized for company-wide reuse\r\nBuild efficient, well-tested User Interface components in React and Redux\r\nIdentify bottlenecks to improve performance\r\n\r\nThe ability to lead by influence rather than by directing\r\nA plus if you have experience in designing and developing for accessibility and internationalization\r\nA proven ability to deliver production-quality solutions\r\n8+ years of development experience with modern CSS and JavaScript frameworks.\r\n3+ years of development experience with React\r\nExperience with Storybook or similar UI component explorer is a strong plus\r\nFamiliar with and encourages OWASP practices\r\nMobile experience (Android, iOS, Xamarin) a plus\r\nAbility to participate in code reviews, design reviews, and over-the-shoulder debugging.\r\nExperience working with modern front-end build tools, testing frameworks and practices (e.g. Node, NPM, Yarn, WebPack)\r\nThe ability to understand, debug and improve asynchronous code\r\n", "Job Link": "https://stackoverflow.com/jobs/406259/senior-lead-software-engineer-architecture-draftkings"},
{"Job title": "Full Stack Software Engineer", "Company": "Algorand, Inc.", "Company's logo Image Url": ["https://i.stack.imgur.com/1PAc9.png"], "Location": "– Boston, MA", "Skills Required": "\"node.js\",\"python\",\"javascript\"", "Perks offered": ["Commuter Assistance Plans", "Health Insurance", "Dental Insurance", "Vision Insurance", "On-site Fitness center", "Work from Home Flexibility", "Paid Holidays"], "About This Job": ["Job type: ", "Full-time", "Experience level: ", "Mid-Level, Senior, Lead", "Role: ", "Full Stack Developer", "Industry: ", "blockchain technology, Computer Software", "Company size: ", "51–200 people"], "Description": "\r\nDesign and build applications  on top of Algorand’s platform\r\nBe a hands-on coder applying the best industry standards for code health, security, scalability, and robustness\r\nBe a key part of an inclusive environment that fosters collaboration and creativity both internally and externally\r\n\r\nBachelor’s in Computer Science or a related technical field (level and depth of responsibilities will be adjusted for Master’s/PhD in Computer Science or a related technical field)\r\nFive-plus years of experience working on and shipping complex applications as part of a team; advanced education will be considered (in extraordinary cases)\r\nExperience working on web-based applications is required\r\nExperience with one or more general-purpose programming languages including but not limited to: Python, Javascript, and/or Node.js\r\nExperience contributing to major open source software projects will be considered favorably\r\nAbility to work in-office during regular business hours\r\nEnjoyment for working in a highly collaborative, fast-paced, and dynamic environment\r\n", "Job Link": "https://stackoverflow.com/jobs/393643/full-stack-software-engineer-algorand-inc"}
]